<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"55221734a55f96ed3141e0c74ebd48a9589118d62e12cea66f4ecde2c947c1e5","plan_job_ref":"Job Environment Main - Plan #47 at https://github.com/jarrod-lowe/wildsea/actions/runs/10397381754","plan_out_hash":"a48fd0bc43eea549567859987958656422c89476127b99b499af45a14ea5b3f2","plan_hash":"e314d7d640710a1fcc6b70d8e64854dd3cc813a6d0b9ffc54e2df814823209ec","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.wildsea.aws_appsync_graphql_api.graphql will be created
+   resource "aws_appsync_graphql_api" "graphql" {
+       arn                  = (known after apply)
+       authentication_type  = "AWS_IAM"
+       id                   = (known after apply)
+       introspection_config = "ENABLED"
+       name                 = "Wildsea-primary"
+       query_depth_limit    = 0
+       resolver_count_limit = 0
+       schema               = <<-EOT
            type Mutation {
                createGame(input: CreateGameInput!): Game!
            }
            
            type Query {
                getGame(input: ID!): Game!
            }
            
            input CreateGameInput {
                name: String!
                description: String
                publicNotes: String
                privateNotes: String
                fireflyUserId: ID!
                players: [ID!]!
            }
            
            type Game {
              id: ID!
              name: String!
              description: String
              publicNotes: String
              privateNotes: String
            #  fireflyUser: User!
            #  players: [ID!]!
            #  playerSheets: [PlayerSheet!]!
            #  shipSheet: ShipSheet
            #  clocks: [Clock!]!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
        EOT
+       tags                 = {
+           "Name" = "Wildsea-primary"
        }
+       tags_all             = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary"
        }
+       uris                 = (known after apply)
+       visibility           = "GLOBAL"
+       xray_enabled         = true

+       additional_authentication_provider {
+           authentication_type = "AMAZON_COGNITO_USER_POOLS"

+           user_pool_config {
+               aws_region   = "ap-southeast-2"
+               user_pool_id = "************************"
            }
        }

+       log_config {
+           cloudwatch_logs_role_arn = (known after apply)
+           exclude_verbose_content  = false
+           field_log_level          = "ERROR"
        }
    }

  # module.wildsea.aws_cloudwatch_log_group.graphql_log will be created
+   resource "aws_cloudwatch_log_group" "graphql_log" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/appsync/Wildsea-primary"
+       name_prefix       = (known after apply)
+       retention_in_days = 14
+       skip_destroy      = false
+       tags              = {
+           "Name" = "Wildsea-primary"
        }
+       tags_all          = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_iam_role.graphql_log will be created
+   resource "aws_iam_role" "graphql_log" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "appsync.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "Wildsea-primary-graphql-log"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Name" = "Wildsea-primary"
        }
+       tags_all              = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.wildsea.aws_iam_role_policy_attachment.grahql_log will be created
+   resource "aws_iam_role_policy_attachment" "grahql_log" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AWSAppSyncPushToCloudWatchLogs"
+       role       = "Wildsea-primary-graphql-log"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #47](https://github.com/jarrod-lowe/wildsea/actions/runs/10397381754)